Hi @mildwonkey,

Thanks for your quick reply, but I'm not sure if this will keep consistent. At least for what I tried to do, didn't work pretty well and it was messing with the resources. Also, the Terraform has a function to sort, maybe would be nice to remove the sort from the values(), keys() and for_each or have some way to disable the sorting.

For example, the first run will be like:

```terraform
variable "iam_users_info" {
  type = map(string)
  default = {
    "g@example.com" = "devops"
    "c@example.com" = "devops"
    "h@example.com" = "developers"
  }
}

resource "aws_iam_user" "example" {
  count = length(var.iam_users_info)

  name = keys(var.iam_users_info)[count.index]
}
```

Output

```text
An execution plan has been generated and is shown below.
Resource actions are indicated with the following symbols:
  + create

Terraform will perform the following actions:

  # aws_iam_user.example[0] will be created
  + resource "aws_iam_user" "example" {
      + arn           = (known after apply)
      + force_destroy = false
      + id            = (known after apply)
      + name          = "c@example.com"
      + path          = "/"
      + unique_id     = (known after apply)
    }

  # aws_iam_user.example[1] will be created
  + resource "aws_iam_user" "example" {
      + arn           = (known after apply)
      + force_destroy = false
      + id            = (known after apply)
      + name          = "g@example.com"
      + path          = "/"
      + unique_id     = (known after apply)
    }

  # aws_iam_user.example[2] will be created
  + resource "aws_iam_user" "example" {
      + arn           = (known after apply)
      + force_destroy = false
      + id            = (known after apply)
      + name          = "h@example.com"
      + path          = "/"
      + unique_id     = (known after apply)
    }

Plan: 3 to add, 0 to change, 0 to destroy.
```

And if you add another item into this map that changes the order, it break the terraform:

```terraform
variable "iam_users_info" {
  type = map(string)
  default = {
    "g@example.com" = "devops"
    "c@example.com" = "devops"
    "h@example.com" = "developers"
    "a@example.com" = "developers"
  }
}

resource "aws_iam_user" "example" {
  count = length(var.iam_users_info)

  name = keys(var.iam_users_info)[count.index]
}
```

Output

```text
An execution plan has been generated and is shown below.
Resource actions are indicated with the following symbols:
  + create
  ~ update in-place

Terraform will perform the following actions:

  # aws_iam_user.example[0] will be updated in-place
  ~ resource "aws_iam_user" "example" {
        arn           = "arn:aws:iam::<ACCOUNT_ID>:user/c@example.com"
        force_destroy = false
        id            = "c@example.com"
      ~ name          = "c@example.com" -> "a@example.com"
        path          = "/"
        tags          = {}
        unique_id     = "<UNIQUE_ID>"
    }

  # aws_iam_user.example[1] will be updated in-place
  ~ resource "aws_iam_user" "example" {
        arn           = "arn:aws:iam::<ACCOUNT_ID>:user/g@example.com"
        force_destroy = false
        id            = "g@example.com"
      ~ name          = "g@example.com" -> "c@example.com"
        path          = "/"
        tags          = {}
        unique_id     = "<UNIQUE_ID>"
    }

  # aws_iam_user.example[2] will be updated in-place
  ~ resource "aws_iam_user" "example" {
        arn           = "arn:aws:iam::<ACCOUNT_ID>:user/h@example.com"
        force_destroy = false
        id            = "h@example.com"
      ~ name          = "h@example.com" -> "g@example.com"
        path          = "/"
        tags          = {}
        unique_id     = "<UNIQUE_ID>"
    }

  # aws_iam_user.example[3] will be created
  + resource "aws_iam_user" "example" {
      + arn           = (known after apply)
      + force_destroy = false
      + id            = (known after apply)
      + name          = "h@example.com"
      + path          = "/"
      + unique_id     = (known after apply)
    }

Plan: 1 to add, 3 to change, 0 to destroy.

Do you want to perform these actions?
  Terraform will perform the actions described above.
  Only 'yes' will be accepted to approve.

  Enter a value: yes

aws_iam_user.example[3]: Creating...
aws_iam_user.example[2]: Modifying... [id=h@example.com]
aws_iam_user.example[1]: Modifying... [id=g@example.com]
aws_iam_user.example[0]: Modifying... [id=c@example.com]
aws_iam_user.example[0]: Modifications complete after 0s [id=a@example.com]

Error: Error updating IAM User g@example.com: EntityAlreadyExists: User with name c@example.com already exists.
	status code: 409, request id: <REQUEST_ID>



Error: Error updating IAM User h@example.com: EntityAlreadyExists: User with name g@example.com already exists.
	status code: 409, request id: <REQUEST_ID>



Error: Error creating IAM User h@example.com: EntityAlreadyExists: User with name h@example.com already exists.
	status code: 409, request id: <REQUEST_ID>
```